fabrika/src/InformationRegisters/НастройкаПодключенийКБазам/НастройкаПодключенийКБазам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПодключенийКБазам</name>
  <resources>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерверCOMОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипПлатформы1С</name>
    <comment>Тип платформы1 С</comment>
    <type>
      <types>EnumRef.ТипПлатформы1С</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСоединения</name>
    <comment>Тип соединения</comment>
    <type>
      <types>EnumRef.ТипСоединения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/Enums/ТипСоединения/ТипСоединения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСоединения</name>
  <comment>Тип соединения</comment>
  <enumValues>
    <name>Com</name>
    <comment>Com</comment>
  </enumValues>
  <enumValues>
    <name>Http</name>
    <comment>Http</comment>
  </enumValues>
</mdclass:Enum>

fabrika/src/CommonModules/ПодключениеКВнешнимИБ/Module.bsl
//////////////////////////////////////ПРОЦЕДУРЫ И ФУНКЦИИ СОЕДИНЕНИЯ С ВНЕШНИМИ ИБ//////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


Процедура ПроверкаПодключения(ТипОрганизации,АдресСтруктурыПодключений,Отказ = Ложь, СтруктураПодключенийФоновая = Неопределено) экспорт
	
	СтруктураПодключений = ПолучитьИзВременногоХранилища(АдресСтруктурыПодключений);
	
	Если ТипЗнч(СтруктураПодключенийФоновая) = Тип("Структура") Тогда
		СтруктураПодключений = СтруктураПодключенийФоновая;
	КонецЕсли;	
		
	ДанныеПодключения = Новый Структура;
	Если СтруктураПодключений.Свойство(ТипОрганизации, ДанныеПодключения) Тогда
		
		Если ТипЗнч(ДанныеПодключения.Подключение) = Тип("COMОбъект") Тогда
			возврат;
		Иначе
			ДанныеПодключения.Состояние = "Не подключено";
		КонецЕсли;
		
	КонецЕсли;
	
	ПодключениеКВнешнимИБ.ДобавлениеПодключенияКБазе(ТипОрганизации,СтруктураПодключений,Отказ);		
	
	////Дима 05.03.2015 12:05:48////После изменения снова помещаем структуру подключений во временное хранилище по тому же адресу
	ПоместитьВоВременноеХранилище(СтруктураПодключений, АдресСтруктурыПодключений);
	//конец Дима
		
КонецПроцедуры

Процедура ДобавлениеПодключенияКБазе(ТипОрганизации,СтруктураПодключений,Отказ = Ложь) экспорт
	
	Отбор = Новый Структура("ТипОрганизации, ТипСоединения", ТипОрганизации, Перечисления.ТипСоединения.Com);
	ПодключениеКИБ = РегистрыСведений.НастройкаПодключенийКБазам.Получить(Отбор);
    
    //Обработаем пустые данные
    Если ПустаяСтрока(ПодключениеКИБ.СтрокаПодключения) Тогда                   
        Отказ = Истина;
		ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, "Нет настройки подключения" + "	0");
		Возврат;        
    КонецЕсли;    
        
    
	СтрокаПодключения = ПодключениеКИБ.СтрокаПодключения +"Usr="+
	                    Символ(34)+ПодключениеКИБ.Пользователь+Символ(34)+";Pwd="+ПодключениеКИБ.Пароль;
	
	Попытка
		КОМ = Новый COMОбъект(Строка(ПодключениеКИБ.ТипПлатформы1С) +  ".ComConnector", ПодключениеКИБ.СерверCOMОбъекта);					
		Base = КОМ.Connect(СтрокаПодключения);
	Исключение
		Отказ = Истина;
		ОбщийМодульСервер.ДобавитьСоообщениеВмассив(, ОписаниеОшибки() + "	0");
		Возврат;
	КонецПопытки;
	
	Подключение = Новый Структура("ТипОрганизации,Подключение,Состояние",ТипОрганизации,Base,"Подключено");
	
	СтруктураПодключений.Вставить(ТипОрганизации,Подключение);	
	
	
КонецПроцедуры
